app/controllers/cadastro_prods_controller.rb

  def index
    @cadastro_prods = CadastroProd.all
---
SELECT "cadastro_prods".* FROM "cadastro_prods"

  def create
    @cadastro_prod = CadastroProd.new(cadastro_prod_params)

    respond_to do |format|
      if @cadastro_prod.save
---
INSERT INTO "cadastro_prods" ("categoria", "produto", "preco", "info", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @cadastro_prod.update(cadastro_prod_params)
---
UPDATE "cadastro_prods" SET "info" = $1, "updated_at" = $2 WHERE "cadastro_prods"."id" = $3  [["info", "Concentrado."], ["updated_at", "2018-09-27 03:15:28.073791"], ["id", 1]]

    def set_cadastro_prod
      @cadastro_prod = CadastroProd.find(params[:id])
---
SELECT  "cadastro_prods".* FROM "cadastro_prods" WHERE "cadastro_prods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]